In [29]:
import numpy as np
import pymongo
import pandas as pd

from bson.json_util import dumps
myclient = pymongo.MongoClient("mongodb+srv://Timhore_123:Timhore123@cluster0.hj64h.mongodb.net/") # server mongoDB
mydb = myclient["Dataset"] # nama database
mycol = mydb["house_data"] # nama collection
query = mycol.find() # query yang dijalankan menhasilkan data tipe cursor
list_query = list(query) # konversi cursor menjadi list
json_data = dumps(list_query, indent = 2)
df = pd.read_json(json_data)
df.isna().sum()

_id              0
date             0
price            0
bedrooms         0
bathrooms        0
sqft_living      0
sqft_lot         0
floors           0
waterfront       0
view             0
condition        0
sqft_above       0
sqft_basement    0
yr_built         0
yr_renovated     0
street           0
city             0
statezip         0
country          0
dtype: int64

In [30]:
df.head()

,_id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
0,{'$oid': '62c3a25fd6355f6f88bffcaf'},2014-05-02,313000.0,3,1.50,1340,7912,1.5,0,0,3,1340,0,1955,2005,18810 Densmore Ave N,Shoreline,WA 98133,USA
1,{'$oid': '62c3a25fd6355f6f88bffcb0'},2014-05-02,2384000.0,5,2.50,3650,9050,2.0,0,4,5,3370,280,1921,0,709 W Blaine St,Seattle,WA 98119,USA
2,{'$oid': '62c3a25fd6355f6f88bffcb1'},2014-05-02,342000.0,3,2.00,1930,11947,1.0,0,0,4,1930,0,1966,0,26206-26214 143rd Ave SE,Kent,WA 98042,USA
3,{'$oid': '62c3a25fd6355f6f88bffcb2'},2014-05-02,420000.0,3,2.25,2000,8030,1.0,0,0,4,1000,1000,1963,0,857 170th Pl NE,Bellevue,WA 98008,USA
4,{'$oid': '62c3a25fd6355f6f88bffcb3'},2014-05-02,550000.0,4,2.50,1940,10500,1.0,0,0,4,1140,800,1976,1992,9105 170th Ave NE,Redmond,WA 98052,USA

In [31]:
df.drop(['_id','country', 'date', 'floors', 'view', 'sqft_basement', 'yr_renovated', 'waterfront','city','street','statezip','sqft_above','sqft_lot'], axis=1, inplace=True)

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4600 entries, 0 to 4599
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   price        4600 non-null   float64
 1   bedrooms     4600 non-null   int64
 2   bathrooms    4600 non-null   float64
 3   sqft_living  4600 non-null   int64
 4   condition    4600 non-null   int64
 5   yr_built     4600 non-null   int64
dtypes: float64(2), int64(4)
memory usage: 215.8 KB

In [33]:
#mencari outliners menggunakan standart score dengan treshold 2.7
z = abs((df - df.mean())/df.std(ddof=0))
print(z)
for col in df.columns:
    df.loc[z[col] > 2.7] = np.nan

         price  bedrooms  bathrooms  sqft_living  condition  yr_built
0     0.423864  0.441122   0.843204     0.829971   0.667112  0.531014
1     3.249598  1.759705   0.432802     1.568528   2.286416  1.674693
2     0.372424  0.441122   0.205201     0.217367   0.809652  0.161000
3     0.234071  0.441122   0.113800     0.144686   0.809652  0.261913
4     0.003482  0.659291   0.432802     0.206984   0.809652  0.175376
...        ...       ...        ...          ...        ...       ...
4595  0.432437  0.441122   0.524202     0.653458   0.809652  0.564651
4596  0.031271  0.441122   0.432802     0.705374   0.667112  0.410840
4597  0.239562  0.441122   0.432802     0.904009   0.667112  1.285418
4598  0.618268  0.659291   0.205201     0.051238   0.667112  0.108101
4599  0.587759  0.441122   0.432802     0.674224   0.809652  0.646303

[4600 rows x 6 columns]

In [34]:
#menghapus outliner
print(df.isnull().sum())
df.dropna(inplace=True)

print(df.isnull().sum())

price          182
bedrooms       182
bathrooms      182
sqft_living    182
condition      182
yr_built       182
dtype: int64
price          0
bedrooms       0
bathrooms      0
sqft_living    0
condition      0
yr_built       0
dtype: int64

In [40]:
#menghitung jumlah missing value
df.isna().sum()

price          0
bedrooms       0
bathrooms      0
sqft_living    0
condition      0
yr_built       0
dtype: int64

In [36]:
#menghapus baris yang terdapat missing value 
df.dropna(axis=0, how='all')

              price  bedrooms  bathrooms  sqft_living  condition  yr_built
0     313000.000000       3.0       1.50       1340.0        3.0    1955.0
2     342000.000000       3.0       2.00       1930.0        4.0    1966.0
3     420000.000000       3.0       2.25       2000.0        4.0    1963.0
4     550000.000000       4.0       2.50       1940.0        4.0    1976.0
5     490000.000000       2.0       1.00        880.0        3.0    1938.0
...             ...       ...        ...          ...        ...       ...
4595  308166.666667       3.0       1.75       1510.0        4.0    1954.0
4596  534333.333333       3.0       2.50       1460.0        3.0    1983.0
4597  416904.166667       3.0       2.50       3010.0        3.0    2009.0
4598  203400.000000       4.0       2.00       2090.0        3.0    1974.0
4599  220600.000000       3.0       2.50       1490.0        4.0    1990.0

[4418 rows x 6 columns]